{
  "clip_id": "yt_bbe5eccf",
  "original_metadata": {
    "clip_id": "yt_bbe5eccf",
    "source": "youtube",
    "source_id": "nCHI0b5-Dkg",
    "local_path": "clip_storage/yt_bbe5eccf.mp4",
    "original_url": "https://www.youtube.com/watch?v=nCHI0b5-Dkg",
    "acquired_at": "2025-05-13T17:14:30.554586",
    "title": null,
    "processed": false
  },
  "processed_at": "2025-05-13T17:15:06.239631",
  "output_dir": "processed_clips/yt_bbe5eccf",
  "duration": 298.06408882141113,
  "transcript": "They open up the floor. On the mid-range, short again. Murray retrieves the loose ball. Wide open. Gordon for the tie! Got it! The Thunder are gonna play. Dagnal will not take the timeout. Gordon trying to guard Jaylen Williams. Three second difference between the shot and game clock. Gilgeous Alexander on the wing against Brown, rips through, throws up the shot, rebounded by Jokic. They got a little bit of time. That's on the timeout. 2.7 to go. Gordon to trigger, into Jokic for the win! And we will play five more minutes as Jokic now six for 22, but he'll get another opportunity to redeem himself. Three changes, 12 ties and Jokic wins the tip. Oklahoma City going really with a smaller lineup, Caruso having to guard Aaron Gordon. Jokic rips through to his left. Left it on the rim and then it fell. Denver up to to start the overtime. Williams, Dort drives the close out. Caruso back to Gilgeous Alexander, five on the shot clock. Hartenstein, that little floater, he overcooked it. This nuggets team has been in this situation many times before. Murray rejects the screen. Good pass. Porter Jr. for three. Nuggets with their largest lead of the game. Williams knocked away. And Murray controls, Homgren trying to check into the ball game, and that's gonna be a foul against Dort. With the smaller lineup that Oklahoma City has in the ball game, when Jokic got past Hartenstein, there was really nobody there to challenge at the rim. And Jamal Murray, with two-man game up top, refuses the screen, draws two defenders and a beautiful pass out to a relocating Michael Porter Jr. And he's had a terrific game playing in pain. 21 points, five of six from three for Michael Porter Jr. Six on the shot clock, Murray pulls the deep one, and that comes off to Holmgren. Thunder down by five, under three and a half to go. Gilgeous Alexander, just seven of 22 tonight. Inside, Otto Williams. Mark Mark Dagnault going back with that three big lineup, getting Holmgren back in the game. Murray switched onto Williams. Good help by Porter Jr. who knocked it away. Murray around the world inside! What a finish! Timeout, Thunder! By Murray out top. Gilgeous Alexander staring down Brown. Hartenstein got it back and Murray got there first. That's twice now that Hartenstein has missed from in close. Too strong, and then too short that last time. The Thunder are o for four in the extra period. Brown off the Jokic screen, Jokic. Porter Jr.. Murray with one on the clock. Didn't get it off in time. That will not count. Better look here today. Well they gotta move the ball. It's been all off the dribble, attacking a set defense. Look how everybody there's Shell is established in that essentially zone. Man, Homegren uses the self-checkout line and slams it home. It's down to a five-point game, under two minutes to play. Dort trying to deny Murray the basketball. Goes underneath the screen. Got hit by that Joker screen. Jokic with the floater. Got it! Arguably the most prolific two-man game in basketball. Gilgeous Alexander out to Holmgren. And that rims out. Denver in control with just 117 to play. OK see has one foul to give. Barton, dagger. With that shoulder injury where he can barely get his left arm over his head, 21 points, eight rebounds, five of six from three for Michael Porter Jr. Williams partially blocked by Watson and it's elementary Watson at this time. And what does it say for OK see if they can't beat Denver on a night when Jokic goes eight for 25. We'll find out on Sunday right here on ABC what their temperament will look like.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 16.7,
      "text": "The Nuggets on offense, Thunder playing defense.  The ball goes to the mid-range and the shot is short.  Murray gets the rebound.  The ball is passed to Gordon for a wide open shot, which Gordon makes. Score tied 102 - 102."
    },
    {
      "start_time": 22.6,
      "end_time": 28.0,
      "text": "The Thunder on offense and not calling a timeout to advance the ball up court."
    },
    {
      "start_time": 28.0,
      "end_time": 58.5,
      "text": "The Thunder have possession with about 11 seconds on the shot clock. The ball comes to Gilgeous-Alexander and the shot bounces off the rim. Jokic gets the rebound and the Nuggets call a timeout with 2.7 seconds left in the game."
    },
    {
      "start_time": 58.5,
      "end_time": 107.3,
      "text": "The game is tied at 102-102. End of regulation. The timeout is over and the Nuggets have an inbound play. Jokic shoots a jump shot and misses. The game goes into overtime."
    },
    {
      "start_time": 107.3,
      "end_time": 134.6,
      "text": "Jump ball for overtime.  Nuggets win the tip and Jokic lays in a shot to give the Nuggets a two point lead."
    },
    {
      "start_time": 134.6,
      "end_time": 151.1,
      "text": "Thunder get the ball.  Offensive play in progress. Hartenstein takes a floater shot and overcooks it."
    },
    {
      "start_time": 151.1,
      "end_time": 163.5,
      "text": "The nuggets now have possession of the ball. The analyst comments that this Nuggets team has been in this situation before."
    },
    {
      "start_time": 163.5,
      "end_time": 205.9,
      "text": "Nuggets offensive play continues. Good pass from Murray to Porter Jr. for the 3 point bucket."
    },
    {
      "start_time": 205.9,
      "end_time": 222.7,
      "text": "Nuggets have their largest lead of the game.  Thunder try to score but the ball is knocked away by Murray who controls."
    },
    {
      "start_time": 222.7,
      "end_time": 245.0,
      "text": "Thunder on defense and there is a foul called."
    },
    {
      "start_time": 245.0,
      "end_time": 248.2,
      "text": "Replay highlights the earlier play."
    },
    {
      "start_time": 268.8,
      "end_time": 313.4,
      "text": "Offensive play in progress. Murray switched to Williams.  Good help by Porter Jr. He knocked it away. Murray around the world inside! Great finish!"
    },
    {
      "start_time": 313.4,
      "end_time": 320.9,
      "text": "Time out Thunder called. After Murray makes a phenomenal pass."
    },
    {
      "start_time": 324.9,
      "end_time": 350.6,
      "text": "Offensive play is executed, Hartenstein gets the rebound and tries a close in shot but it just misses.  The Thunder get possession and move the ball."
    },
    {
      "start_time": 350.6,
      "end_time": 359.0,
      "text": "The ball goes to Yokic who is screened by a player. Yokic gets the floater to go in the basket!"
    },
    {
      "start_time": 363.6,
      "end_time": 406.4,
      "text": "Holmgren gets the inbounds and dunks it! Murray gets the ball after passing the ball and then can't release the shot fast enough as the clock expires."
    },
    {
      "start_time": 406.4,
      "end_time": 422.8,
      "text": "Analyst comments that the ball has to move more to execute their plays more efficiently. Thunder has the ball and Holmgren dunks it after the pass!"
    },
    {
      "start_time": 422.8,
      "end_time": 446.3,
      "text": "It's a five point game as it moves to the Nuggets to execute an offensive play. Jokic is involved. Holmgren gets the ball."
    },
    {
      "start_time": 446.3,
      "end_time": 520.4,
      "text": "Holmgren's shot rims off the basket! Gordon rebounds and scores! Nuggets 113, Thunder 104. That's when Hartenstein missed from that short corner and analyst comments the game has championship pedigree."
    },
    {
      "start_time": 520.4,
      "end_time": 576.7,
      "text": "And elementary with that shoulder injury where he can barely get his left arm over his head. Analyst comments on statistics on Michael Porter Jr.. The final score in overtime is announced as 113 to 104 in overtime. The Denver Nuggets win."
    },
    {
      "start_time": 576.7,
      "end_time": 644.2,
      "text": "Michael Porter Jr. gets congratulatory hugs! Final comments and the scene fades to the screen."
    }
  ],
  "players_mentioned": [
    "Murray",
    "Gordon",
    "Jaylen Williams",
    "Gilgeous Alexander",
    "Brown",
    "Jokic",
    "Hartenstein",
    "Holmgren",
    "Dort",
    "Michael Porter Jr.",
    "Watson",
    "Otto Williams",
    "Caruso"
  ],
  "key_events": [
    {
      "time": 14.9,
      "event": "Aaron Gordon makes a 3-pointer to tie the game"
    },
    {
      "time": 42.4,
      "event": "Gilgeous Alexander shot is rebounds by Jokic"
    },
    {
      "time": 54.1,
      "event": "Jokic misses game winning basket, goes into OT"
    },
    {
      "time": 130.5,
      "event": "Jokic left handed shot"
    },
    {
      "time": 204.4,
      "event": "Porter Jr. scores a three point bucket"
    },
    {
      "time": 301.9,
      "event": "Jamal Murray makes a pass for a bucket in the paint"
    },
    {
      "time": 319.8,
      "event": "Timeout, Thunder"
    },
    {
      "time": 331.6,
      "event": "Hartenstein misses another close range shot"
    },
    {
      "time": 402.0,
      "event": "Murray attempts to make shot but time expires"
    },
    {
      "time": 421.3,
      "event": "Oklahoma City makes a slam dunk!"
    },
    {
      "time": 517.6,
      "event": "Gordon makes the bucket!"
    }
  ]
}