{
  "clip_id": "yt_3df8d566",
  "original_metadata": {
    "clip_id": "yt_3df8d566",
    "source": "youtube",
    "source_id": "_ijAzBZkptI",
    "local_path": "clip_storage/yt_3df8d566.mp4",
    "original_url": "https://www.youtube.com/watch?v=_ijAzBZkptI",
    "acquired_at": "2025-05-13T16:32:43.637886",
    "title": null,
    "processed": true,
    "processed_at": "2025-05-13T17:09:04.504579"
  },
  "processed_at": "2025-05-13T17:11:13.869816",
  "output_dir": "processed_clips/yt_3df8d566",
  "duration": 600,
  "transcript": "Welcome to the game between the Lakers and the Celtics. LeBron with the ball at the top of the key. He drives to the basket, nice crossover, goes up for the layup... and it's good! Great move by LeBron James giving the Lakers a 3-point lead. Tatum bringing it up for the Celtics, passes to Brown on the wing. Brown for three... Got it! Jaylen Brown ties the game with a clutch three-pointer. Lakers ball with 45 seconds remaining in the fourth quarter. Davis sets the screen, LeBron uses it, pulls up for the mid-range jumper... Scores! Lakers back up by 2 with 30 seconds to go. Celtics looking for a quick response. Tatum drives, spins, kicks it out to Smart. Smart for three... No good! Davis with the rebound. Lakers will hold for the final shot of the game.",
  "segments": [
    {
      "start_time": 0.0,
      "end_time": 3.0,
      "text": "Welcome to the game between the Lakers and the Celtics."
    },
    {
      "start_time": 3.2,
      "end_time": 10.5,
      "text": "LeBron with the ball at the top of the key. He drives to the basket, nice crossover, goes up for the layup... and it's good!"
    },
    {
      "start_time": 10.6,
      "end_time": 14.2,
      "text": "Great move by LeBron James giving the Lakers a 3-point lead."
    },
    {
      "start_time": 14.3,
      "end_time": 20.1,
      "text": "Tatum bringing it up for the Celtics, passes to Brown on the wing. Brown for three... Got it!"
    },
    {
      "start_time": 20.2,
      "end_time": 23.8,
      "text": "Jaylen Brown ties the game with a clutch three-pointer."
    },
    {
      "start_time": 24.0,
      "end_time": 33.5,
      "text": "Lakers ball with 45 seconds remaining in the fourth quarter. Davis sets the screen, LeBron uses it, pulls up for the mid-range jumper... Scores!"
    },
    {
      "start_time": 33.6,
      "end_time": 36.8,
      "text": "Lakers back up by 2 with 30 seconds to go."
    },
    {
      "start_time": 37.0,
      "end_time": 45.2,
      "text": "Celtics looking for a quick response. Tatum drives, spins, kicks it out to Smart. Smart for three... No good! Davis with the rebound."
    },
    {
      "start_time": 45.3,
      "end_time": 48.5,
      "text": "Lakers will hold for the final shot of the game."
    }
  ],
  "players_mentioned": [
    "LeBron James",
    "Jayson Tatum",
    "Jaylen Brown",
    "Marcus Smart",
    "Anthony Davis"
  ],
  "key_events": [
    {
      "time": 8.5,
      "event": "LeBron James scores a layup"
    },
    {
      "time": 18.2,
      "event": "Jaylen Brown hits a three-pointer"
    },
    {
      "time": 31.0,
      "event": "LeBron James scores a mid-range jumper"
    },
    {
      "time": 42.5,
      "event": "Marcus Smart misses a three-pointer"
    },
    {
      "time": 43.0,
      "event": "Anthony Davis gets the rebound"
    }
  ],
  "is_dummy": true
}